DataProcessors/CRM_ЗагрузкаДанныхАвтоскладаЧерезWS_New.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>CRM_ЗагрузкаДанныхАвтоскладаЧерезWS_New</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_УтвержденныеРезервы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_УтвержденныеРезервы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SedreNum</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРезерва</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияСРезерва</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ИзмененияАвтосклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ИзмененияАвтосклад</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОписаниеИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/CRM_СостояниеАвтомобилейПроизводителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_СостояниеАвтомобилейПроизводителя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГодВыпуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоставОпций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДнейНаСкладе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтгрузкиАФМ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ИнформацияПоЗаявкамDistri.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ИнформацияПоЗаявкамDistri</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерКлиентскойЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродажаВнесена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерОрдера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_ЗаявкаНаАвтомобиль</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтрокиДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_СтоимостьДоставкиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_СтоимостьДоставкиАвтомобилей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтоимостьДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ОпцииАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ОпцииАвтомобилей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Опция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Опции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОпцииВариантовКомплектации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОпцииВариантовКомплектации</Name>
			<Comment>Опции вариантов комплектации</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество опций</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаЗакупки</Name>
					<Comment>Цена закупки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидВключения</Name>
					<Comment>0 - Устанавливается продавцом, 1 - Устанавливается производителем, 2 - Устанавливается по умолчанию</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВариантКомплектации</Name>
					<Comment>Вариант комплектации модели автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Опция</Name>
					<Comment>Опция комплектации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Опции</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<Comment>Цены</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, историю цен которого необходимо хранить. Если &lt;пусто&gt;, то цену установили мы.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/CRM_ЗагрузкаДанныхАвтоскладаЧерезWS_New/Ext/ObjectModule.bsl
Перем СтоимостьДоставкиПоУмолчанию;

Процедура ОбработкаНаСервере() Экспорт
	
	ПолучитьДанные();
	
КонецПроцедуры // ОбработкаНаСервере()

Процедура ПолучитьДанные() Экспорт
	
	МожноПисать = Ложь;
	
	АдресWS	 = Константы.Renault_АдресWebСервисов.Получить();
	ЛогинWS	 = Константы.Renault_ЛогинВебСервиса.Получить();
	ПарольWS = Константы.Renault_ПарольВебСервиса.Получить();
	
	
	//удалим определение документа wsdl - его добавляем автоматически
	АдресWS = СтрЗаменить(АдресWS, "ws/storeexchange.1cws?wsdl", "");
	
	ВСОпределение = Новый WSОпределения(СокрЛП(АдресWS) + "ws/storeexchange.1cws?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/storeeschange", 
							   "storeexchange", "storeexchangeSoap12", 6000);
	
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);
	
	СервисФабрика = ВебСервис.ФабрикаXDTO;
	
	ИдентификаторДилера = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных(); 
	МассивБирДляПолученияДанных = ПолучитьМассивБирДляПолученияДанных();
	СтрокаBIR = СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(
		МассивБирДляПолученияДанных, ";"); 
	Сериализатор = Новый СериализаторXDTO(СервисФабрика);
	ТаблицаДанныхОбАвтомобиляхПроизводителяXDTO = ВебСервис.GetData(СтрокаBIR);
	Если ТаблицаДанныхОбАвтомобиляхПроизводителяXDTO = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Получим стоимость доставки
	//Плохо Доделать
	//Дилерских центров может быть несколько
	ДилерскийЦентрВыборка = Справочники.CRM_ДилерскиеЦентры.Выбрать();
	Если ДилерскийЦентрВыборка.Следующий() Тогда
		СтоимостьДоставкиПоУмолчанию = ДилерскийЦентрВыборка.СтоимостьДоставкиПоУмолчанию;
	Иначе
		СтоимостьДоставкиПоУмолчанию = 0;
	КонецЕсли;
	
	ТаблицаДанныхОбАвтомобиляхПроизводителя = Сериализатор.ПрочитатьXDTO(ТаблицаДанныхОбАвтомобиляхПроизводителяXDTO);
    МассивVIN = ТаблицаДанныхОбАвтомобиляхПроизводителя.ВыгрузитьКолонку("VIN");
	ЗагрузитьДанныеВИБ(ТаблицаДанныхОбАвтомобиляхПроизводителя);
	ПровестиКорректирующиеДокументы(МассивVIN);
	СнятьРезервы(МассивVIN);
	ДополнитьАвтомобилямиПодписанныеДКП();
	ВебСервис.RegOperation(ИдентификаторДилера);
	
КонецПроцедуры // ПолучитьДанные()

Процедура ПровестиКорректирующиеДокументы(МассивVIN)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_РучнаяКорректировкаДанныхСклада.Ссылка
	               |ИЗ
	               |	Документ.Renault_РучнаяКорректировкаДанныхСклада КАК Renault_РучнаяКорректировкаДанныхСклада
	               |ГДЕ
	               |	Renault_РучнаяКорректировкаДанныхСклада.Проведен = ИСТИНА
	               |	И Renault_РучнаяКорректировкаДанныхСклада.VIN В(&VIN)";
	Запрос.УстановитьПараметр("VIN", МассивVIN); 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СнятьРезервы(МассивVIN)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_УтвержденныеРезервы.Регистратор
	               |ИЗ
	               |	РегистрСведений.Renault_УтвержденныеРезервы КАК Renault_УтвержденныеРезервы
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(Renault_УтвержденныеРезервы.ДатаСнятияСРезерва, ДЕНЬ) < НАЧАЛОПЕРИОДА(&ТекДата, ДЕНЬ)
	               |	И Renault_УтвержденныеРезервы.VIN В(&VIN)";
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("VIN", МассивVIN);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Регистратор.ПолучитьОбъект();
		ДокОбъект.СтатусРезерва = Перечисления.CRM_СтатусыРезервовАвтомобилей.РезервСнят;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
КонецПроцедуры

Функция РазобратьРезультат(СервисФабрика, Результат)
	
	СтрокаДанныхАвтомобилейПроизводителя = СервисФабрика.Создать(СервисФабрика.Тип("http://renault-nissan.com/schema/avtoinfo", "СтрокаДанныхАвтомобилейПроизводителя"));
	СвойстваЗаписи = СтрокаДанныхАвтомобилейПроизводителя.Свойства();
	
	ТаблицаДанныхОбАвтомобиляхПроизводителя = Новый ТаблицаЗначений;
	Для каждого ЗначениеСвойстваЗаписи Из СвойстваЗаписи Цикл
		
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить(ЗначениеСвойстваЗаписи.Имя);
		
	КонецЦикла;
	
	СтрокиДанныхАвтомобилейПроизводителя = Результат.СтрокиДанныхАвтомобилейПроизводителя;
	
	Для каждого СтрокаДанных Из СтрокиДанныхАвтомобилейПроизводителя Цикл
		
		НовСтрока = ТаблицаДанныхОбАвтомобиляхПроизводителя.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаДанных);
		//Если Год(НовСтрока.DATE_MADC) = 1900 Тогда
		//	НовСтрока.DATE_MADC = Дата('00010101');
		//КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаДанныхОбАвтомобиляхПроизводителя;
	
КонецФункции

Процедура ЗагрузитьДанныеВИБ(ТаблицаДанныхОбАвтомобиляхПроизводителя)
	
	//Добавим колонки
	
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("Model_Full") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("Model_Full");
	КонецЕсли;
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("Автомобиль") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("Автомобиль");
	КонецЕсли;
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("Модель") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("Модель");
	КонецЕсли;
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("Версия") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("Версия");
	КонецЕсли;
    Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("Цвет") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("Цвет");
	КонецЕсли;
    Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("Статус") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("Статус");
	КонецЕсли;	
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("ЦенаПродажиБаза") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("ЦенаПродажиБаза");
	КонецЕсли;	
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("ЦенаПродажиОпции") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("ЦенаПродажиОпции");
	КонецЕсли;
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("ЦенаПродажиДопОборудования") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("ЦенаПродажиДопОборудования");
	КонецЕсли;
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("СебестоимостьДопОборудования") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("СебестоимостьДопОборудования");
	КонецЕсли;
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("ЦенаПродажиАвтомобиля") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("ЦенаПродажиАвтомобиля");
	КонецЕсли;	
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("ЦенаЗакупкиБаза") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("ЦенаЗакупкиБаза");
	КонецЕсли;	
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("ЦенаЗакупкиОпции") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("ЦенаЗакупкиОпции");
	КонецЕсли;
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("ЦенаЗакупкиАвтомобиля") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("ЦенаЗакупкиАвтомобиля");
	КонецЕсли;
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("ЦенаПродажиДоставка") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("ЦенаПродажиДоставка");
	КонецЕсли;
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("ТипАвтомобиля") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("ТипАвтомобиля");
	КонецЕсли;
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("ЦенаКлиентская") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("ЦенаКлиентская");
	КонецЕсли;
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("ЦенаДилерская") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("ЦенаДилерская");
	КонецЕсли;
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("НаименованияОпций") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("НаименованияОпций");
	КонецЕсли;
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("ЦветМеталлик") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("ЦветМеталлик");
	КонецЕсли;
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("БлокировкаАФМ") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("БлокировкаАФМ");
	КонецЕсли;
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("СебестоимостьПоТН") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("СебестоимостьПоТН");
	КонецЕсли;
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("НаУдаление") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("НаУдаление");
	КонецЕсли;
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("НаДобавление") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("НаДобавление");
	КонецЕсли;
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Найти("Скрывать") = Неопределено Тогда
		ТаблицаДанныхОбАвтомобиляхПроизводителя.Колонки.Добавить("Скрывать");
	КонецЕсли;
	
	//Получим таблицы опций для парсинга
	ТаблицаПакетовОпций = ПолучитьТаблицуСоставныхОпций();
	ТаблицаОтдельныхОпций = ПолучитьТаблицуОтдельныхОпций();
	
	//Дополняем данные по а/м
	Для Каждого ДанныеПоАвто ИЗ ТаблицаДанныхОбАвтомобиляхПроизводителя Цикл
		ЗаполнитьНедостающиеДанные(ДанныеПоАвто, ТаблицаПакетовОпций, ТаблицаОтдельныхОпций);
 	КонецЦикла;

	//Если таблица пустая, дальше делать ничего не надо
	Если ТаблицаДанныхОбАвтомобиляхПроизводителя.Количество() = 0 Тогда 		
		Возврат;		
	КонецЕсли;
	
	Для Каждого Строка Из ТаблицаДанныхОбАвтомобиляхПроизводителя Цикл
		МенеджерЗаписиРегистра = РегистрыСведений.CRM_СостояниеАвтомобилейПроизводителя_v2.СоздатьМенеджерЗаписи();
		МенеджерЗаписиРегистра.VIN = Строка.VIN;
		МенеджерЗаписиРегистра.Прочитать();
		Если Строка.УдалитьСтроку Тогда	
			Если МенеджерЗаписиРегистра.Выбран() Тогда
				МенеджерЗаписиРегистра.Скрывать = Ложь;
				МенеджерЗаписиРегистра.НаУдаление = Истина;
				МенеджерЗаписиРегистра.Записать();
				Если Не ЕстьПроведеннаяРучнаяКорректировка(Строка.VIN, 1) И
					Не  ЕстьПроведеннаяРучнаяКорректировка(Строка.VIN, 0) Тогда 
					ДобавитьВЖурналЗаписьОбУдалении(Строка.VIN);
				КонецЕсли;
			КонецЕсли;
		Иначе
			ЗаполнитьЗначенияСвойств(МенеджерЗаписиРегистра, Строка);
			Если Не МенеджерЗаписиРегистра.Выбран() Тогда
				МенеджерЗаписиРегистра.Скрывать = Истина;
				МенеджерЗаписиРегистра.НаДобавление = Истина;
				Если Не ЕстьПроведеннаяРучнаяКорректировка(Строка.VIN, 2) Тогда 
					ДобавитьВЖурналЗаписьОДобавлении(Строка.VIN);
				КонецЕсли;
			КонецЕсли;
			МенеджерЗаписиРегистра.Записать();
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Процедура ДобавитьВЖурналЗаписьОДобавлении(VIN)
	
	Запись = РегистрыСведений.Renault_ИзмененияАвтосклад.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДата();
	Запись.VIN = VIN;
	Запись.ОписаниеИзменений = "Добавлено";
	Запись.Записать();	
	
КонецПроцедуры

Процедура ДобавитьВЖурналЗаписьОбУдалении(VIN)
	
	Запись = РегистрыСведений.Renault_ИзмененияАвтосклад.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДата();
	Запись.VIN = VIN;
	Запись.ОписаниеИзменений = "Удалено";
	Запись.Записать();
	
КонецПроцедуры

Функция ЕстьПроведеннаяРучнаяКорректировка(VIN, РежимРаботы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_РучнаяКорректировкаДанныхСклада.VIN
		|ИЗ
		|	Документ.Renault_РучнаяКорректировкаДанныхСклада КАК Renault_РучнаяКорректировкаДанныхСклада
		|ГДЕ
		|	Renault_РучнаяКорректировкаДанныхСклада.Проведен = ИСТИНА
		|	И Renault_РучнаяКорректировкаДанныхСклада.РежимРаботы = &РежимРаботы
		|	И Renault_РучнаяКорректировкаДанныхСклада.VIN = &VIN";	
	 Запрос.УстановитьПараметр("РежимРаботы", РежимРаботы);
	 Запрос.УстановитьПараметр("VIN", VIN);
	 РезультатЗапроса = Запрос.Выполнить();
	 Возврат Не РезультатЗапроса.Пустой();
	 
КонецФункции

Процедура ЗагрузитьВИБСтрокуДанных(СтрокаДанных)
	
	Если ЗначениеЗаполнено(СтрокаДанных.VIN) Тогда 
		
		НаборЗаписей = РегистрыСведений.CRM_СостояниеАвтомобилейПроизводителя.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.VIN.Установить(СокрЛП(СтрокаДанных.VIN));
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		НовЗапись = НаборЗаписей.Добавить();
		
		НовЗапись.VIN = СокрЛП(СтрокаДанных.VIN);
		НовЗапись.Модель = Справочники.Модели.НайтиПоРеквизиту("Артикул", СокрЛП(СтрокаДанных.КодМодели));
		
		Если ЗначениеЗаполнено(НовЗапись.Модель) Тогда 
			НовЗапись.Версия = Справочники.ВариантыКомплектации.НайтиПоРеквизиту("Артикул", СокрЛП(СтрокаДанных.Версия),, НовЗапись.Модель);
		КонецЕсли;
		
		НовЗапись.Цвет = Справочники.Цвета.НайтиПоРеквизиту("Артикул", СокрЛП(СтрокаДанных.КодЦвета));
		НовЗапись.ГодВыпуска = СокрЛП(СтрокаДанных.ГодВыпуска);
		НовЗапись.СоставОпций = СтрокаДанных.СоставОпций;
		НовЗапись.НомерПТС = СтрокаДанных.НомерПТС;
		НовЗапись.ДатаПроизводства = СтрокаДанных.ДатаПроизводства;
		НовЗапись.КоличествоДнейНаСкладе = СтрокаДанных.КоличествоДнейНаСкладе;
		НовЗапись.ДатаОтгрузкиАФМ = СтрокаДанных.ФактическаяДатаОтгрузки;
		НовЗапись.Статус = ПолучитьСтатусАвтомобиляПроизводителяПоСтроке(СтрокаДанных.Статус);
		                              
		НовЗапись.Автомобиль = НайтиСоздатьАвтомобильПоВину(СтрокаДанных.VIN, НовЗапись, СтрокаДанных);
		
	КонецЕсли;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьСтатусАвтомобиляПроизводителяПоСтроке(СтрокаСтатуса)
	
	Если ЗначениеЗаполнено(СтрокаСтатуса) Тогда 
		
		Если НРег(СтрокаСтатуса) = "впроизводстве" Тогда 
			Возврат Перечисления.CRM_СтатусыАвтомобилей.ВПроизводстве;
		ИначеЕсли НРег(СтрокаСтатуса) = "впути" Тогда 
			Возврат Перечисления.CRM_СтатусыАвтомобилей.ВПути;
		ИначеЕсли НРег(СтрокаСтатуса) = "выданклиенту" Тогда 
			Возврат Перечисления.CRM_СтатусыАвтомобилей.ВыданКлиенту;
		ИначеЕсли НРег(СтрокаСтатуса) = "доставлендилеру" Тогда 
			Возврат Перечисления.CRM_СтатусыАвтомобилей.ДоставленДилеру;
		ИначеЕсли НРег(СтрокаСтатуса) = "клиентскаязаявка" Тогда 
			Возврат Перечисления.CRM_СтатусыАвтомобилей.КлиентскаяЗаявка;
		ИначеЕсли НРег(СтрокаСтатуса) = "наскладеафм" Тогда 
			Возврат Перечисления.CRM_СтатусыАвтомобилей.НаСкладеАФМ;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьАртикулМодели(СтрокаТаблицы)
	Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Model_Full) Тогда
		СтрокаТаблицы.Model_Full = СтрокаТаблицы.MODEL+СтрокаТаблицы.FG_PROJET+СтрокаТаблицы.FG_PHASE;
	КонецЕсли;
КонецПроцедуры

Функция НайтиСоздатьАвтомобильПоВину_v2(VIN, ДанныеПоАвтомобилю)
	
	ВалютаУчета = Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	ВерсияАльфаАвто = Renault_CRM.ВерсияАльфаАвто();
		
	Если ВерсияАльфаАвто = "5" Тогда		
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Автомобили.Ссылка,
		|	Автомобили.Модель,
		|	Автомобили.Цвет,
		|	Автомобили.ВариантКомплектации
		|ИЗ
		|	Справочник.Автомобили КАК Автомобили
		|ГДЕ
		|	(Автомобили.VIN = &VIN
		|			ИЛИ Автомобили.ОригинальныйVIN = &VIN)";
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Автомобили.Ссылка,
		|	Автомобили.Модель,
		|	Автомобили.Цвет,
		|	Автомобили.ВариантКомплектации
		|ИЗ
		|	Справочник.Автомобили КАК Автомобили
		|ГДЕ
		|	Автомобили.VIN = &VIN";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("VIN", VIN);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда //Такой автомобиль уже создан в системе
		
		НовыйАвтомобиль = Выборка.Ссылка;
		Модель = Выборка.Модель;
		ВариантКомплектации = Выборка.ВариантКомплектации;
		Цвет = Выборка.Цвет;
		
		//Если заполнены не все свойства - заполним их и запишем карточку
		ЗаписатьОбъект = Ложь;
		Если Не ЗначениеЗаполнено(Выборка.Модель) Тогда
			Модель = ДанныеПоАвтомобилю.Модель;
			ЗаписатьОбъект = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Выборка.ВариантКомплектации) Тогда
			ВариантКомплектации = ДанныеПоАвтомобилю.Версия;
			ЗаписатьОбъект = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Выборка.Цвет) Тогда
			Цвет = ДанныеПоАвтомобилю.Цвет;
			ЗаписатьОбъект = Истина;
		КонецЕсли;
		Если ЗаписатьОбъект Тогда			
			Попытка
				АвтоОбъект = НовыйАвтомобиль.ПолучитьОбъект();
				АвтоОбъект.Модель = Модель;
				АвтоОбъект.ВариантКомплектации = ВариантКомплектации;
				
				Если ВерсияАльфаАвто = "5" Тогда		
					Если Не ЗначениеЗаполнено(АвтоОбъект.ВключатьВПрайсЛист) Тогда
						АвтоОбъект.ВключатьВПрайсЛист = Перечисления.ВидВключенияВПрайсЛист.ПоУмолчанию;
					КонецЕсли;									
				КонецЕсли;
								
				Если Не ЗначениеЗаполнено(АвтоОбъект.ВалютаУчета) Тогда
					АвтоОбъект.ВалютаУчета = ВалютаУчета;
				КонецЕсли;	
				
				АвтоОбъект.Цвет = Цвет;
				Если Не ЗначениеЗаполнено(АвтоОбъект.Код) Тогда
					АвтоОбъект.УстановитьНовыйКод();
				КонецЕсли;
				//Если Не ЗначениеЗаполнено(АвтоОбъект.ЦветКод) Тогда
				//	АвтоОбъект.ЦветКод = "Не заполнено";
				//КонецЕсли;
				АвтоОбъект.Записать();
			Исключение
				//Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
		Возврат НовыйАвтомобиль;
		
	Иначе
		
		ТекМодель = ДанныеПоАвтомобилю.Модель;		
		ТекЦвет = ДанныеПоАвтомобилю.Цвет;
		ТекВерсия = ДанныеПоАвтомобилю.Версия;
		
		Если Не ПустаяСсылка(ТекМодель) Тогда
			
			//Создадим новый автомобиль
			НовыйАвтомобиль = Справочники.Автомобили.СоздатьЭлемент();
			НовыйАвтомобиль.VIN = VIN;
			НовыйАвтомобиль.Модель = ТекМодель;
			НовыйАвтомобиль.ВариантКомплектации = ТекВерсия;
			НовыйАвтомобиль.Цвет = ТекЦвет;
			//Если Не ЗначениеЗаполнено(НовыйАвтомобиль.ЦветКод) Тогда
			//	НовыйАвтомобиль.ЦветКод = "Не заполнено";
			//КонецЕсли;
			
			НовыйАвтомобиль.ВалютаУчета = ВалютаУчета;			
			
			Если ВерсияАльфаАвто = "5" Тогда		
				Если Не ЗначениеЗаполнено(НовыйАвтомобиль.ВключатьВПрайсЛист) Тогда
					НовыйАвтомобиль.ВключатьВПрайсЛист = Перечисления.ВидВключенияВПрайсЛист.ПоУмолчанию;
				КонецЕсли;					
			Иначе
				Если Не ЗначениеЗаполнено(НовыйАвтомобиль.Код) Тогда
					НовыйАвтомобиль.УстановитьНовыйКод();
				КонецЕсли;
			КонецЕсли;

			//НовыйАвтомобиль.ВключатьВПрайсЛист = Перечисления.ВидВключенияВПрайсЛист.ПоУмолчанию;			
			
			//Сгенерируем наименование автомобиля
			//доделать - настройки наименования автомобиля для разных дилеров
			НовыйАвтомобиль.Наименование = "Автомобиль Renault " + ТекМодель + ", " + ТекЦвет + ", VIN: " + VIN;
			//НовыйАвтомобиль.НаименованиеПолное = НовыйАвтомобиль.Наименование;
			
			//доделать - заполнять дополнительные поля
			//НовыйАвтомобиль.ГодВыпуска = ДанныеПоАвтомобилю.ГодВыпуска;
			//НовыйАвтомобиль.НомерДвигателя = СтроковыеДанные.НомерДвигателя;
				
			Попытка
				НовыйАвтомобиль.Записать();
				Возврат НовыйАвтомобиль.Ссылка;
			Исключение
				//Сообщить(ОписаниеОшибки());
				сфСообщитьОбОшибке(ОписаниеОшибки());
				Возврат Справочники.Автомобили.ПустаяСсылка();
			КонецПопытки;
		Иначе	
			Возврат Справочники.Автомобили.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Справочники.Автомобили.ПустаяСсылка();
	
КонецФункции

Функция НайтиМодель(ДанныеПоМодели, Модель = Неопределено, Версия = Неопределено)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
                           |	Модели.Ссылка
                           |ИЗ
                           |	Справочник.Модели КАК Модели
                           |ГДЕ
                           |	Модели.Артикул = &ДанныеПоМодели");
	Запрос.УстановитьПараметр("ДанныеПоМодели",ДанныеПоМодели);
	Итог = Запрос.Выполнить();
	Если Итог.Пустой() Тогда
		//Найдем по коротким кодам модели и версии
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВариантыКомплектации.Владелец.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.ВариантыКомплектации КАК ВариантыКомплектации
		               |ГДЕ
		               |	ПОДСТРОКА(ВариантыКомплектации.Владелец.Артикул, 0, 3) = &КодМодели
		               |	И ВариантыКомплектации.Артикул = &КодКомплектации";
		Запрос.УстановитьПараметр("КодМодели", Модель);
		Запрос.УстановитьПараметр("КодКомплектации", Версия);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			Возврат Выборка.Ссылка;
		Иначе
			//Найдем по короткому коду модели без учета версии
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	AOC_Комплектации.МодельСпр КАК Ссылка
			               |ИЗ
			               |	РегистрСведений.AOC_Комплектации КАК AOC_Комплектации
			               |ГДЕ
			               |	ПОДСТРОКА(AOC_Комплектации.КодМодели, 0, 3) = &КодМодели";
			Запрос.УстановитьПараметр("КодМодели", Модель);			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда 
				Возврат Выборка.Ссылка;
			Иначе
				Возврат Справочники.Модели.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТаблицаМодель = Итог.Выгрузить();
		Возврат ТаблицаМодель[0].Ссылка;
	КонецЕсли;
		
КонецФункции

Функция НайтиЦвет(Артикул)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Цвета.Ссылка
	                      |ИЗ
	                      |	Справочник.Цвета КАК Цвета
	                      |ГДЕ
	                      |	Цвета.Артикул = &Артикул");
	Запрос.УстановитьПараметр("Артикул",Артикул);
	Итог = Запрос.Выполнить();
	Если Итог.Пустой() Тогда
		Возврат Справочники.Цвета.ПустаяСсылка();
	Иначе
		Ответ = Итог.Выгрузить();
		Возврат Ответ[0].Ссылка;
	КонецЕсли;
		
КонецФункции

Функция НайтиВерсию(КодКомплектации, Модель)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВариантыКомплектации.Ссылка
	                      |ИЗ
	                      |	Справочник.ВариантыКомплектации КАК ВариантыКомплектации
	                      |ГДЕ
	                      |	ВариантыКомплектации.Владелец = &МодельСпр
	                      |	И ВариантыКомплектации.Артикул = &КодКомплектации");
	Запрос.УстановитьПараметр("КодКомплектации", КодКомплектации);
	Запрос.УстановитьПараметр("МодельСпр", Модель);
	Итог = Запрос.Выполнить();
	Если Итог.Пустой() Тогда
		Возврат Справочники.ВариантыКомплектации.ПустаяСсылка();
	Иначе
		Ответ = Итог.Выгрузить();
		Возврат Ответ[0].Ссылка;
	КонецЕсли;
		
КонецФункции

Процедура ДополнитьАвтомобилямиПодписанныеДКП()
	
	Запрос = новый Запрос("ВЫБРАТЬ
	                      |	ТЧ_СоставДоговора.Ссылка,
	                      |	CRM_СостояниеАвтомобилейПроизводителя_v2.Автомобиль,
	                      |	CRM_СостояниеАвтомобилейПроизводителя_v2.VIN,
	                      |	ТЧ_СоставДоговора.Идентификатор
	                      |ИЗ
	                      |	Документ.Renault_Договор.СоставДоговора КАК ТЧ_СоставДоговора
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_ИнформацияПоЗаявкамDistri КАК Renault_ИнформацияПоЗаявкамDistri
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК CRM_СостояниеАвтомобилейПроизводителя_v2
	                      |			ПО Renault_ИнформацияПоЗаявкамDistri.НомерОрдера = CRM_СостояниеАвтомобилейПроизводителя_v2.SEDRE_ORDER
	                      |		ПО ТЧ_СоставДоговора.Идентификатор = Renault_ИнформацияПоЗаявкамDistri.ИдентификаторСтрокиДоговора
	                      |ГДЕ
	                      |	ТЧ_СоставДоговора.Ссылка.Проведен = ИСТИНА
	                      |	И ТЧ_СоставДоговора.Автомобиль = ЗНАЧЕНИЕ(Справочник.Автомобили.ПустаяСсылка)
	                      |	И ЕСТЬNULL(Renault_ИнформацияПоЗаявкамDistri.НомерОрдера, """") <> """"");	
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Для Каждого Описание Из Таблица Цикл
		Если ЗначениеЗаполнено(Описание.Автомобиль) Тогда
			Попытка 
				ДогОб = Описание.Ссылка.ПолучитьОбъект();
				СтрДоговора = ДогОб.СоставДоговора.Найти(Описание.Идентификатор, "Идентификатор");
				СтрДоговора.Автомобиль = Описание.Автомобиль;
				СтрДоговора.VIN = Описание.VIN;
				ДогОб.Записать(РежимЗаписиДокумента.Проведение);
				Запись = РегистрыСведений.Renault_ИзмененияАвтосклад.СоздатьМенеджерЗаписи();
				Запись.VIN = Описание.VIN;
				Запись.ОписаниеИзменений = "Прикреплен к договору " + Строка(ДогОб.НомерДоговора);
				Запись.Период = ТекущаяДата();
				Запись.Записать();
			Исключение
				Запись = РегистрыСведений.Renault_ИзмененияАвтосклад.СоздатьМенеджерЗаписи();
				Запись.VIN = Описание.VIN;
				Запись.ОписаниеИзменений = "Не удалось прикрепить VIN к договору " + Строка(ДогОб.НомерДоговора);
				Запись.Период = ТекущаяДата();
				Запись.Записать();
			КонецПопытки;			
		КонецЕсли;
	КонецЦикла;
	 	
КонецПроцедуры

Функция ПустаяСсылка(Ссылк)
	
	Возврат Ссылк.Пустая();
	
КонецФункции

Функция НайтиСоздатьАвтомобильПоВину(VIN, ДанныеПоАвтомобилю, СтроковыеДанные)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Автомобили.Ссылка
	|ИЗ
	|	Справочник.Автомобили КАК Автомобили
	|ГДЕ
	|	Автомобили.VIN = &VIN";
	
	Запрос.УстановитьПараметр("VIN", VIN);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		НовыйАвтомобиль = Выборка.Ссылка;
	Иначе 
		НовыйАвтомобиль = Справочники.Автомобили.СоздатьЭлемент();
		НовыйАвтомобиль.VIN = VIN;
		НовыйАвтомобиль.Наименование = "" + ДанныеПоАвтомобилю.Модель + ", " + ДанныеПоАвтомобилю.Цвет + ", VIN: " + VIN;
		НовыйАвтомобиль.Модель = ДанныеПоАвтомобилю.Модель;
		НовыйАвтомобиль.ВариантКомплектации = ДанныеПоАвтомобилю.Версия;
		НовыйАвтомобиль.ГодВыпуска = ДанныеПоАвтомобилю.ГодВыпуска;
		НовыйАвтомобиль.НомерДвигателя = СтроковыеДанные.НомерДвигателя;
		НовыйАвтомобиль.Цвет = ДанныеПоАвтомобилю.Цвет;
		НовыйАвтомобиль.ЦветКод = СтроковыеДанные.КодЦвета;
		НовыйАвтомобиль.УстановитьНовыйКод();
		Попытка
			НовыйАвтомобиль.Записать();
		Исключение
			сфСообщитьОбОшибке(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
	Возврат НовыйАвтомобиль.Ссылка;
	
КонецФункции

Функция НайтиАвтомобильПоВину(VIN)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Автомобили.Ссылка
	|ИЗ
	|	Справочник.Автомобили КАК Автомобили
	|ГДЕ
	|	Автомобили.VIN = &VIN";
	
	Запрос.УстановитьПараметр("VIN", VIN);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат  Выборка.Ссылка;
	Иначе 
		Возврат Справочники.Автомобили.ПустаяСсылка();
	КонецЕсли;
	
	
	
КонецФункции

Процедура ЗаполнитьНедостающиеДанные(ДанныеПоАвто,ТаблицаПакетов,ТаблицаОтдельных)
	
	//Не все автомобили нужно грузить, пропустим ненужные
	Если Не ЗначениеЗаполнено(ДанныеПоАвто.DATE_MADPREV) И Не ЗначениеЗаполнено(ДанныеПоАвто.SEDRE_ORDER) И ДанныеПоАвто.AUTO_STATUS = "В производстве" Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеПоАвто.YEAR) И Число(ДанныеПоАвто.YEAR) < 2011 И Число(ДанныеПоАвто.YEAR) <> 1900 Тогда
		Возврат;
	КонецЕсли;
	
	//Данные по автомобилю
	Ключ = ДанныеПоАвто.VIN ;
	ЗаполнитьАртикулМодели(ДанныеПоАвто);
	ДанныеПоАвто.Модель = НайтиМодель(ДанныеПоАвто.Model_Full, ДанныеПоАвто.MODEL, ДанныеПоАвто.VERSION);
	ДанныеПоАвто.Цвет = НайтиЦвет(ДанныеПоАвто.COLOR);
	ДанныеПоАвто.Версия = НайтиВерсию(ДанныеПоАвто.VERSION, ДанныеПоАвто.Модель);
	ДанныеПоАвто.Автомобиль = НайтиСоздатьАвтомобильПоВину_v2(Ключ,ДанныеПоАвто);	
	ДанныеПоАвто.Статус =  НайтиСтатус(ДанныеПоАвто);	
	Если ЗначениеЗаполнено(ДанныеПоАвто.DATE_MADC_RECU) И Год(Дата(ДанныеПоАвто.DATE_MADC_RECU)) = 1900 Тогда //Плохо
		ДанныеПоАвто.DATE_MADC_RECU = Дата('00010101');
		ДанныеПоАвто.DATE_MADC = Дата('00010101');
	КонецЕсли;
	
	//Определим стоимость доставки а/м
	СтоимостьДоставки = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЕСТЬNULL(ЕСТЬNULL(ПоВерсиям.СтоимостьДоставки, ПоМоделям.СтоимостьДоставки), 0) КАК СтоимостьДоставки
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Renault_СтоимостьДоставкиАвтомобилей.СтоимостьДоставки КАК СтоимостьДоставки
	               |	ИЗ
	               |		РегистрСведений.Renault_СтоимостьДоставкиАвтомобилей КАК Renault_СтоимостьДоставкиАвтомобилей
	               |	ГДЕ
	               |		Renault_СтоимостьДоставкиАвтомобилей.Версия = &Версия) КАК ПоВерсиям
	               |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			Renault_СтоимостьДоставкиАвтомобилей.СтоимостьДоставки КАК СтоимостьДоставки
	               |		ИЗ
	               |			РегистрСведений.Renault_СтоимостьДоставкиАвтомобилей КАК Renault_СтоимостьДоставкиАвтомобилей
	               |		ГДЕ
	               |			Renault_СтоимостьДоставкиАвтомобилей.Модель = &Модель) КАК ПоМоделям
	               |		ПО (ИСТИНА)";				   
	Запрос.УстановитьПараметр("Версия", ДанныеПоАвто.Версия);
	Запрос.УстановитьПараметр("Модель", ДанныеПоАвто.Модель);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтоимостьДоставки = Выборка.СтоимостьДоставки;
	КонецЕсли;
	Если СтоимостьДоставки = 0 ИЛИ Не ЗначениеЗаполнено(СтоимостьДоставки) Тогда
		СтоимостьДоставки = СтоимостьДоставкиПоУмолчанию;
	КонецЕсли;
	
	//Поля изменений заполним по умолчанию
	ДанныеПоАвто.НаУдаление = Ложь;
	ДанныеПоАвто.НаДобавление = Ложь;
	ДанныеПоАвто.Скрывать = Ложь;
	
	//Год не везде заполнен, дозаполним
	Если Не ЗначениеЗаполнено(ДанныеПоАвто.YEAR) ИЛИ ДанныеПоАвто.YEAR = 1900 Тогда
		Если ЗначениеЗаполнено(ДанныеПоАвто.DATE_MADC_RECU) Тогда
			ДанныеПоАвто.YEAR = Год(ДанныеПоАвто.DATE_MADC_RECU);  
		ИначеЕсли ЗначениеЗаполнено(ДанныеПоАвто.DATE_MADPREV) Тогда
			ДанныеПоАвто.YEAR = Год(ДанныеПоАвто.DATE_MADPREV);  
		Иначе
			ДанныеПоАвто.YEAR = "";  
		КонецЕсли;
	КонецЕсли;
	
	//Поля булево передаются строками, преобразуем
	Если ДанныеПоАвто.COLOR_METALLIC = "1" Тогда
		ДанныеПоАвто.ЦветМеталлик = Истина;
	Иначе
		ДанныеПоАвто.ЦветМеталлик = Ложь;
	КонецЕсли;
	
	Если ДанныеПоАвто.IS_BLOCKED = "1" Тогда
		ДанныеПоАвто.БлокировкаАФМ = Истина;
	Иначе
		ДанныеПоАвто.БлокировкаАФМ = Ложь;
	КонецЕсли;
	
	//Заполним тип автомобиля
	Если ДанныеПоАвто.FACTURE_TYPE_RU = "Продажа VND (фактура)" Тогда
		ДанныеПоАвто.ТипАвтомобиля = Справочники.Renault_ТипыАвтомобилей.VND;
	ИначеЕсли ДанныеПоАвто.FACTURE_TYPE_RU = "Подменные автомобили" Тогда
		ДанныеПоАвто.ТипАвтомобиля = Справочники.Renault_ТипыАвтомобилей.Подменный;
	ИначеЕсли ДанныеПоАвто.FACTURE_TYPE_RU = "Демонстрационные автомобили" Тогда
		ДанныеПоАвто.ТипАвтомобиля = Справочники.Renault_ТипыАвтомобилей.Демонстрационный;
	ИначеЕсли ДанныеПоАвто.FACTURE_TYPE_RU = "Факторинг" Тогда
		ДанныеПоАвто.ТипАвтомобиля = Справочники.Renault_ТипыАвтомобилей.НаПродажу;
	ИначеЕсли ДанныеПоАвто.FACTURE_TYPE_RU = "Консигнация+Факторинг" Тогда
		ДанныеПоАвто.ТипАвтомобиля = Справочники.Renault_ТипыАвтомобилей.НаПродажу;
	ИначеЕсли ДанныеПоАвто.FACTURE_TYPE_RU = "Факторинг по прил. 11" Тогда
		ДанныеПоАвто.ТипАвтомобиля = Справочники.Renault_ТипыАвтомобилей.НаПродажу;
	ИначеЕсли ДанныеПоАвто.FACTURE_TYPE_RU = "Консигнация" Тогда
		ДанныеПоАвто.ТипАвтомобиля = Справочники.Renault_ТипыАвтомобилей.НаПродажу;
	ИначеЕсли ДанныеПоАвто.FACTURE_TYPE_RU = "Продажа в кредит по прил. 11" Тогда
		ДанныеПоАвто.ТипАвтомобиля = Справочники.Renault_ТипыАвтомобилей.НаПродажу;
	ИначеЕсли ДанныеПоАвто.FACTURE_TYPE_RU = "Продажа в кредит (кузовостроители)" Тогда
		ДанныеПоАвто.ТипАвтомобиля = Справочники.Renault_ТипыАвтомобилей.НаПродажу;
	ИначеЕсли ДанныеПоАвто.FACTURE_TYPE_RU = "Продажа в кредит по прил. 1" Тогда
		ДанныеПоАвто.ТипАвтомобиля = Справочники.Renault_ТипыАвтомобилей.НаПродажу;
	Иначе
		ДанныеПоАвто.ТипАвтомобиля = Справочники.Renault_ТипыАвтомобилей.НаПродажу;
	КонецЕсли;
	
	//Предрасчет цен
	ЦенаПродажиОпции = 0;
	ЦенаПродажиДопОборудования = 0;
	ЦенаЗакупкиОпции = 0;
	ЦенаПродажиБаза = 0;
	ЦенаЗакупкиБаза = 0;
	Идентификатор = "";
	
	//База
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕстьNULL(AOC_КомплектацииСрезПоследнихПродажи.ЦенаКлиентская,0) КАК ЦенаКлиентская,
	               |	AOC_КомплектацииСрезПоследнихПродажи.Идентификатор,
	               |	ЕстьNULL(AOC_КомплектацииСрезПоследнихЗакупки.ЦенаДилерская,0) КАК ЦенаДилерская
	               |ИЗ
	               |	РегистрСведений.AOC_Комплектации.СрезПоследних(
	               |			&Период,
	               |			МодельСпр = &Модель
	               |				И ВариантКомплектацииСпр = &Версия) КАК AOC_КомплектацииСрезПоследнихПродажи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.AOC_Комплектации.СрезПоследних(
	               |				&ПериодЗакупки,
	               |				МодельСпр = &Модель
	               |					И ВариантКомплектацииСпр = &Версия) КАК AOC_КомплектацииСрезПоследнихЗакупки
	               |		ПО (ИСТИНА)";
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Если ЗначениеЗаполнено(ДанныеПоАвто.DATE_FACT) Тогда
		ПериодЗакупки = ДанныеПоАвто.DATE_FACT;
	Иначе
		ПериодЗакупки = ТекущаяДата();
	КонецЕсли;
	Запрос.УстановитьПараметр("ПериодЗакупки", ПериодЗакупки);
	Запрос.УстановитьПараметр("Модель", ДанныеПоАвто.Модель);
	Запрос.УстановитьПараметр("Версия", ДанныеПоАвто.Версия);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЦенаПродажиБаза = Выборка.ЦенаКлиентская;
		ЦенаЗакупкиБаза = Выборка.ЦенаДилерская*1.18;
		Идентификатор = Выборка.Идентификатор;
	Иначе
		//Сообщить("нет цены");
	КонецЕсли;
	
	ОпцииАвто = новый массив();
	Если ЗначениеЗаполнено(ДанныеПоАвто.OPTIONS) Тогда
		АртикулыОпций  = ДанныеПоАвто.OPTIONS;
		Отбор = Новый Структура();
		Отбор.Вставить("Идентификатор",Идентификатор);
		//ТабПакетовМашина = ТаблицаПакетов.НайтиСтроки(Отбор); 
		//ТабОтдельныхМашина = ТаблицаОтдельных.НайтиСтроки(Отбор);
		ОпцииАвто = МассивОпцийПоСтроке(АртикулыОпций,ТаблицаПакетов,ТаблицаОтдельных,Отбор);
		
	КонецЕсли;

	/////////
	//Опции
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		//МассивОпц = Новый Массив();
		//Для Каждого Опц Из ОпцииАвто Цикл
		//	МассивОпц.Добавить(СокрЛП(Опц.Артикул));
		//КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЕСТЬNULL(AOC_ОпцииСрезПоследних.ЦенаКлиентская, 0) КАК Цена,
		               |	ЕСТЬNULL(AOC_ОпцииСрезПоследних.ЦенаДилерская, 0) КАК ЦенаДилерская,
		               |	AOC_ОпцииСрезПоследних.ОпцияСпр КАК Опция,
		               |	AOC_ОпцииСрезПоследних.КодОпции КАК Код,
		               |	AOC_ОпцииСрезПоследних.НаименованиеОпции КАК Наименование,
		               |	&VIN
		               |ИЗ
		               |	РегистрСведений.AOC_Опции.СрезПоследних(
		               |			&Период,
		               |			Идентификатор = &Идентификатор
		               |				И ОпцияСпр В (&МассивОпций)) КАК AOC_ОпцииСрезПоследних";
		Запрос.УстановитьПараметр("Период", ТекущаяДата());
		Запрос.УстановитьПараметр("VIN", ДанныеПоАвто.VIN);
		Запрос.УстановитьПараметр("МассивОпций", ОпцииАвто);
		Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ЦенаЗакупкиОпции = 0;
		ЦенаПродажиОпции = 0;
		
		
		//Удалим запись опций по вину	
		Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Renault_ОпцииАвтомобилей.VIN,
	                      |	Renault_ОпцииАвтомобилей.Опция
	                      |ИЗ
	                      |	РегистрСведений.Renault_ОпцииАвтомобилей КАК Renault_ОпцииАвтомобилей
	                      |ГДЕ
	                      |	Renault_ОпцииАвтомобилей.VIN = &VIN");
		Запрос.УстановитьПараметр("VIN", ДанныеПоАвто.VIN);
		Таблица = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ТекЗапись Из Таблица Цикл
			Мен = РегистрыСведений.Renault_ОпцииАвтомобилей.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Мен,ТекЗапись);
			Мен.Прочитать();
			Если Мен.Выбран() Тогда
				Мен.Удалить();
			КонецЕсли;				
		КонецЦикла;
		
		КонкатинацияНаименованийОпций = "";
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.Цена) Тогда
				ЦенаПродажиОпции = ЦенаПродажиОпции + Выборка.Цена;
			КонецЕсли;
			Если ЗначениеЗаполнено(Выборка.ЦенаДилерская) Тогда
				ЦенаЗакупкиОпции = ЦенаЗакупкиОпции + Выборка.ЦенаДилерская;
			КонецЕсли;
			
			//Обновим запись опций по вину
			Мен = РегистрыСведений.Renault_ОпцииАвтомобилей.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Мен, Выборка);
	        Мен.Записать();
			
			//Козлов Е.А. Начало 07.07.2016 //обновим (добавим) записи опции варианта комплектации
			ВариантКомплектации = ДанныеПоАвто.Автомобиль.ВариантКомплектации;
			ЗаписьОВК = РегистрыСведений.ОпцииВариантовКомплектации.СоздатьМенеджерЗаписи();
			ЗаписьОВК.ВариантКомплектации = ВариантКомплектации;
			ЗаписьОВК.Опция = Выборка.Опция;
			ЗаписьОВК.Количество = 1;
			ЗаписьОВК.ЦенаЗакупки = Выборка.ЦенаДилерская;
			ЗаписьОВК.ВидВключения = 2;
			ЗаписьОВК.Записать(Истина);
			//Козлов Е.А. Конец
			
			//Получим конкатинацию наименований
			КонкатинацияНаименованийОпций = КонкатинацияНаименованийОпций + Выборка.Наименование + " ";
			
		КонецЦикла;
		
		КонкатинацияНаименованийОпций = СокрЛП(КонкатинацияНаименованийОпций);

	КонецЕсли;
	
	ДанныеПоАвто.ЦенаПродажиОпции = ЦенаПродажиОпции;	
	ДанныеПоАвто.ЦенаПродажиБаза = ЦенаПродажиБаза;
	ДанныеПоАвто.НаименованияОпций = КонкатинацияНаименованийОпций;
	
	//Доп оборудование
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(КомплектацияАвтомобилей.Сумма) КАК СуммаЗакупки,
	|	СУММА(ЦеныСрезПоследних.Цена) КАК СуммаПродажи
	|ИЗ
	|	РегистрНакопления.КомплектацияАвтомобилей КАК КомплектацияАвтомобилей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних КАК ЦеныСрезПоследних
	|		ПО КомплектацияАвтомобилей.Номенклатура = ЦеныСрезПоследних.Номенклатура
	|ГДЕ
	|	КомплектацияАвтомобилей.Автомобиль = &Автомобиль
	|	И (КомплектацияАвтомобилей.Регистратор ССЫЛКА Документ.ВводОстатковАвтомобилей
	|			ИЛИ КомплектацияАвтомобилей.Регистратор ССЫЛКА Документ.ЗаказНаряд
	|			ИЛИ КомплектацияАвтомобилей.Регистратор ССЫЛКА Документ.ИнвентаризацияАвтомобилей)
	|	И КомплектацияАвтомобилей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|ИМЕЮЩИЕ
	|	СУММА(КомплектацияАвтомобилей.Количество) <> 0";
	Запрос.УстановитьПараметр("Автомобиль", ДанныеПоАвто.Автомобиль);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЦенаПродажиДопОборудования = Выборка.СуммаПродажи;
		СебестоимостьДопОборудования = Выборка.СуммаЗакупки;
		Если Не ЗначениеЗаполнено(ЦенаПродажиДопОборудования) Тогда
			ЦенаПродажиДопОборудования = 0;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СебестоимостьДопОборудования) Тогда
			СебестоимостьДопОборудования = 0;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеПоАвто.ЦенаПродажиДопОборудования = ЦенаПродажиДопОборудования;
	ДанныеПоАвто.СебестоимостьДопОборудования = СебестоимостьДопОборудования;
	
	//Итоги
	
	ДанныеПоАвто.ЦенаПродажиАвтомобиля = ЦенаПродажиОпции + ЦенаПродажиБаза + СтоимостьДоставки + ЦенаПродажиДопОборудования;
	ДанныеПоАвто.ЦенаКлиентская = ЦенаПродажиБаза + ЦенаПродажиОпции + СтоимостьДоставки;
	
	//Стоимость доставки 
	ДанныеПоАвто.ЦенаПродажиДоставка = СтоимостьДоставки;	
	
	//Стоимость закупки
	Если ЗначениеЗаполнено(ДанныеПоАвто.DEALER_PRICE_OPTION)Тогда
		ДанныеПоАвто.ЦенаЗакупкиОпции = ДанныеПоАвто.DEALER_PRICE_OPTION;
	Иначе
		ДанныеПоАвто.ЦенаЗакупкиОпции = ЦенаЗакупкиОпции;
    КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПоАвто.DEALER_PRICE_BASE)Тогда
		ДанныеПоАвто.ЦенаЗакупкиБаза = ДанныеПоАвто.DEALER_PRICE_BASE;
	Иначе
		ДанныеПоАвто.ЦенаЗакупкиБаза= ЦенаЗакупкиБаза;
    КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеПоАвто.DEALER_PRICE_FULL)Тогда
		ДанныеПоАвто.ЦенаЗакупкиАвтомобиля = ДанныеПоАвто.DEALER_PRICE_FULL;
		ДанныеПоАвто.ЦенаДилерская = ДанныеПоАвто.DEALER_PRICE_FULL;
		ДанныеПоАвто.СебестоимостьПоТН = ДанныеПоАвто.DEALER_PRICE_FULL;
	Иначе
		ДанныеПоАвто.ЦенаЗакупкиАвтомобиля = ЦенаЗакупкиОпции + ЦенаЗакупкиБаза;
		ДанныеПоАвто.ЦенаДилерская = ЦенаЗакупкиОпции + ЦенаЗакупкиБаза;
    КонецЕсли;
	
КонецПроцедуры

Функция НайтиСтатус(ДанныеПоАвто)
	//Статус автомобиля (в производстве, в транспорте до АФМ, на складе AFM, отправлен дилеру, на складе дилера)	
	Если ДанныеПоАвто.AUTO_STATUS = "В производстве" Тогда
		Возврат Перечисления.CRM_СтатусыАвтомобилей.ВПроизводстве;
	ИначеЕсли ДанныеПоАвто.AUTO_STATUS = "В транспорте до АФМ" Тогда
		Возврат Перечисления.CRM_СтатусыАвтомобилей.ВПути;
	ИначеЕсли ДанныеПоАвто.AUTO_STATUS = "Отправлен дилеру" Тогда
		Возврат Перечисления.CRM_СтатусыАвтомобилей.ВПутиКДилеру;
	ИначеЕсли ДанныеПоАвто.AUTO_STATUS = "На складе дилера" Тогда
		Возврат Перечисления.CRM_СтатусыАвтомобилей.ВПутиКДилеру;
	//ИначеЕсли ДанныеПоАвто.AUTO_STATUS = "в производстве" Тогда
	//	Возврат Перечисления.CRM_СтатусыАвтомобилей.ЗаказВПроизводство;
	ИначеЕсли ДанныеПоАвто.AUTO_STATUS = "На складе AFM" Тогда
		Возврат Перечисления.CRM_СтатусыАвтомобилей.НаСкладеАФМ;
	Иначе
		Возврат Перечисления.CRM_СтатусыАвтомобилей.ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьМассивБирДляПолученияДанных()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CRM_ДилерскиеЦентры.BIR_Distri
	               |ИЗ
	               |	Справочник.CRM_ДилерскиеЦентры КАК CRM_ДилерскиеЦентры
	               |ГДЕ
	               |	CRM_ДилерскиеЦентры.BIR_Distri <> """"";
	МассивСтрокБИР = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("BIR_Distri");
	
	МассивБИР = Новый Массив;
	Для Каждого СтрокаБИР Из МассивСтрокБИР Цикл
		МассивБИРСтроки = CRM_Сервер.РазложитьСтрокуВМассивПодстрок(СтрокаБИР, ",");
		Для Каждого БИР Из МассивБИРСтроки Цикл
			Если МассивБИР.Найти(БИР) = Неопределено Тогда
				МассивБИР.Добавить(БИР);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивБИР;	
	
КонецФункции

Процедура ЭкспАвтомобильПриИзменении(ДогОб) Экспорт
	
	Если ЗначениеЗаполнено(ДогОб.Автомобиль)Тогда
		
		ДогОб.VIN = ДогОб.Автомобиль.VIN;
		ЗаписьСостояниеАвтомобилейПроизводителя = РегистрыСведений.CRM_СостояниеАвтомобилейПроизводителя_v2.СоздатьМенеджерЗаписи();
		ЗаписьСостояниеАвтомобилейПроизводителя.VIN =ДогОб.VIN;
		ЗаписьСостояниеАвтомобилейПроизводителя.Прочитать();
		
		Если ЗаписьСостояниеАвтомобилейПроизводителя.Выбран() Тогда
		
			ДогОб.Модель = ЗаписьСостояниеАвтомобилейПроизводителя.Модель;
			ДогОб.Версия = ЗаписьСостояниеАвтомобилейПроизводителя.Версия;
			ДогОб.Цвет = ЗаписьСостояниеАвтомобилейПроизводителя.Цвет;
			
		Иначе
			
			ДогОб.Модель = ДогОб.Автомобиль.Модель;
			ДогОб.Версия = ДогОб.Автомобиль.ВариантКомплектации;
			ДогОб.Цвет = ДогОб.Автомобиль.Цвет;
			
		КонецЕсли;
		
		ОбновитьСписокДополнительныхОпций(ДогОб);
		//ОбновитьСписокДополнительныхОпцийДилера(ДогОб);
				
		Если ЗаписьСостояниеАвтомобилейПроизводителя.Выбран() Тогда
			
			МассивПодстрок = CRM_Сервер.РазложитьСтрокуВМассивПодстрок(ЗаписьСостояниеАвтомобилейПроизводителя.OPTIONS, " ");
			
			Для Каждого Стр Из ДогОб.ДопОпции Цикл
				
				Если МассивПодстрок.Найти(СокрЛП(Стр.Код)) <> Неопределено Тогда
					Стр.Выбран = Истина;
				Иначе
					Стр.Выбран = Ложь;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
		
	ДогОб.ПТС = ЗаписьСостояниеАвтомобилейПроизводителя.PTS_SERIE + " " + ЗаписьСостояниеАвтомобилейПроизводителя.PTS_NUM;
	ДогОб.МаркаМодельПТС = ЗаписьСостояниеАвтомобилейПроизводителя.ModelTS;
	ДогОб.ТипПТС = ЗаписьСостояниеАвтомобилейПроизводителя.TypeTS;
	ДогОб.КатегорияПТС = ЗаписьСостояниеАвтомобилейПроизводителя.CategTS;
	ДогОб.ГодИзготовленияПТС = ЗаписьСостояниеАвтомобилейПроизводителя.YEAR;
	ДогОб.НомерДвигателяПТС = ЗаписьСостояниеАвтомобилейПроизводителя.ENGINE_NUM;
	ДогОб.НомерШассиПТС = ЗаписьСостояниеАвтомобилейПроизводителя.Shassi;
	ДогОб.НомерКузоваПТС = ЗаписьСостояниеАвтомобилейПроизводителя.Kuzov;
	ДогОб.ЦветКузоваПТС = ЗаписьСостояниеАвтомобилейПроизводителя.COLOR_PTS;
	ДогОб.РазрешеннаяМаксимальнаяМассаПТС = ЗаписьСостояниеАвтомобилейПроизводителя.MaxMass;
	ДогОб.МассаБезНагрузкиПТС = ЗаписьСостояниеАвтомобилейПроизводителя.MinMass;
	ДогОб.МощностьДвигателяПТС = ЗаписьСостояниеАвтомобилейПроизводителя.PowerLS;
	ДогОб.РабочийОбъемДвигателяПТС = ЗаписьСостояниеАвтомобилейПроизводителя.VolumeEngine;
	ДогОб.ТипДвигателяПТС = ЗаписьСостояниеАвтомобилейПроизводителя.TypeEngine;
	ДогОб.ЭкологическийКлассДвигателяПТС = ЗаписьСостояниеАвтомобилейПроизводителя.EcoClass;
	ДогОб.ОрганизацияИзготовительПТС = ЗаписьСостояниеАвтомобилейПроизводителя.NaimProiz;
	ДогОб.ОдобрениеТипаТСПТС = ЗаписьСостояниеАвтомобилейПроизводителя.APPROV_STRING; 		
	ДогОб.ДатаПТС = ЗаписьСостояниеАвтомобилейПроизводителя.DATE_PTS;
	ДогОб.МодельДвигателяПТС = ЗаписьСостояниеАвтомобилейПроизводителя.ENGINE_MODEL;
КонецПроцедуры

Процедура ОбновитьСписокДополнительныхОпций(ДогОб)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификатор", ПолучитьИдентификаторВерсии(ДогОб));
	Запрос.УстановитьПараметр("УжеВыбрано", ДогОб.ДопОпции.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УжеВыбрано.Выбран,
	|	УжеВыбрано.Опция
	|ПОМЕСТИТЬ ВТ_УжеВыбрано
	|ИЗ
	|	&УжеВыбрано КАК УжеВыбрано
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АОС_Опции.ОпцияСпр,
	|	АОС_Опции.ЦенаКлиентская,
	|	АОС_Опции.КодОпции
	|ПОМЕСТИТЬ ВТ_Опции
	|ИЗ
	|	РегистрСведений.AOC_Опции КАК АОС_Опции
	|ГДЕ
	|	АОС_Опции.Базовая = ЛОЖЬ
	|	И АОС_Опции.Идентификатор = &Идентификатор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Опции.ОпцияСпр КАК Опция,
	|	ВТ_Опции.ЦенаКлиентская КАК Цена,
	|	ЕСТЬNULL(ВТ_УжеВыбрано.Выбран, ЛОЖЬ) КАК Выбран,
	|	ВТ_Опции.КодОпции КАК Код
	|ИЗ
	|	ВТ_Опции КАК ВТ_Опции
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УжеВыбрано КАК ВТ_УжеВыбрано
	|		ПО ВТ_Опции.ОпцияСпр = ВТ_УжеВыбрано.Опция";
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	ДогОб.ДопОпции.Загрузить(ТаблицаРезультат);
	
КонецПроцедуры

Функция ПолучитьИдентификаторВерсии(ДогОб)
	
	Если Не ЗначениеЗаполнено(ДогОб.Модель) И Не ЗначениеЗаполнено(ДогОб.Версия) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	AOC_КомплектацииСрезПоследних.Идентификатор
	|ИЗ
	|	РегистрСведений.AOC_Комплектации.СрезПоследних(&ДатаДоговора, ) КАК AOC_КомплектацииСрезПоследних
	|ГДЕ
	|	AOC_КомплектацииСрезПоследних.МодельСпр = &Модель
	|	И AOC_КомплектацииСрезПоследних.ВариантКомплектацииСпр = &Версия";
	Запрос.УстановитьПараметр("ДатаДоговора", ДогОб.Дата);
	Запрос.УстановитьПараметр("Модель", ДогОб.Модель);
	Запрос.УстановитьПараметр("Версия", ДогОб.Версия);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Идентификатор;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТаблицуСоставныхОпций()
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//					  |	Опции.Артикул,
	//					  |	Опции.Ссылка
	//					  |ИЗ
	//					  |	Справочник.Опции КАК Опции
	//					  |ГДЕ
	//					  |	Опции.ПризнакНабора = ИСТИНА
	//					  |	И Опции.ПометкаУдаления = ЛОЖЬ");	
	//Табл = Запрос.Выполнить().Выгрузить();
	//Возврат Табл;
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	AOC_Опции.ОпцияСпр.Ссылка КАК Ссылка,
	                      |	AOC_Опции.ОпцияСпр.Артикул КАК Артикул,
	                      |	AOC_Опции.Идентификатор
	                      |ИЗ
	                      |	РегистрСведений.AOC_Опции КАК AOC_Опции
	                      |ГДЕ
	                      |	AOC_Опции.ОпцияСпр.ПризнакНабора = ИСТИНА
	                      |	И AOC_Опции.ОпцияСпр.ПометкаУдаления = ЛОЖЬ");	
	Табл = Запрос.Выполнить().Выгрузить();
	Возврат Табл;

КонецФункции

Функция ПолучитьТаблицуОтдельныхОпций()
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//					  |	Опции.Артикул,
	//					  |	Опции.Ссылка
	//					  |ИЗ
	//					  |	Справочник.Опции КАК Опции
	//					  |ГДЕ
	//					  |	Опции.ПризнакНабора = ЛОЖЬ
	//					  |	И Опции.ПометкаУдаления = ЛОЖЬ");	
	//Табл = Запрос.Выполнить().Выгрузить();
	//Возврат Табл;
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	AOC_Опции.ОпцияСпр.Ссылка КАК Ссылка,
	                      |	AOC_Опции.ОпцияСпр.Артикул КАК Артикул,
	                      |	AOC_Опции.Идентификатор
	                      |ИЗ
	                      |	РегистрСведений.AOC_Опции КАК AOC_Опции
	                      |ГДЕ
	                      |	AOC_Опции.ОпцияСпр.ПризнакНабора = ЛОЖЬ
	                      |	И AOC_Опции.ОпцияСпр.ПометкаУдаления = ЛОЖЬ");	
	Табл = Запрос.Выполнить().Выгрузить();
	Возврат Табл;

КонецФункции

Функция  ЗаполнитьОпцииАвто (ДанныеАвто,ТаблицаПакетов,ТаблицаОтдельных)
	//ОпцииАвто = новый массив();
	//Если ЗначениеЗаполнено(ДанныеАвто.OPTIONS) Тогда
	//	АртикулыОпций  = ДанныеАвто.OPTIONS;
	//	Отбор = Новый Структура();
	//	ОпцииАвто = МассивОпцийПоСтроке(АртикулыОпций,ТаблицаПакетов,ТаблицаОтдельных,Отбор);
	//	ОбновитьОпцииВина(ДанныеАвто.VIN,ОпцииАвто);
	//КонецЕсли;
	//Возврат ОпцииАвто;
КонецФункции

функция МассивОпцийПоСтроке(Знач ВхАртикулы,ТаблицаПакетов,ТаблицаОтдельных,Отб)
	МассивОпций = Новый Массив();
	ТабПакетов = ТаблицаПакетов.НайтиСтроки(Отб);
	//Для Каждого АртикулПакета Из ТаблицаПакетов Цикл
	Для Каждого АртикулПакета Из ТабПакетов Цикл

		Если ВСтрокеЕстьПакетОпций(ВхАртикулы,АртикулПакета.Артикул) Тогда
			ВхАртикулы = УбратьИзСтрокиПакетОпций(ВхАртикулы,АртикулПакета.Артикул);
			МассивОпций.Добавить(АртикулПакета.Ссылка);
		КонецЕсли;
	КонецЦикла;
	МассивСтроки = обРазложитьСтрокуВМассивПодстрок(вхАртикулы," ");
	Для Каждого ТекАрт Из МассивСтроки Цикл
		Отбор = Новый Структура();
		Отбор.Вставить("Идентификатор",Отб.Идентификатор);
		Отбор.Вставить("Артикул",ТекАрт);
		Табл = ТаблицаОтдельных.НайтиСтроки(Отбор);
		//Индекс = ТаблицаОтдельных.Найти(ТекАрт,"Артикул");
		//Если  Не (Индекс= Неопределено) Тогда
			////МассивСтроки.Удалить(Индекс.Артикул);
			//МассивОпций.Добавить(Индекс.Ссылка);

		Если Табл.Количество()>0 Тогда
			//МассивСтроки.Удалить(Индекс.Артикул);
			МассивОпций.Добавить(Табл[0].Ссылка);
	
		КонецЕсли;
	КонецЦикла;
	Возврат МассивОпций;
	
КонецФункции

Функция ВСтрокеЕстьПакетОпций(вхАртикулы, АртикулПакета)
	МассивАртикулов = обРазложитьСтрокуВМассивПодстрок(АртикулПакета," ");
	МассивСтроки = обРазложитьСтрокуВМассивПодстрок(вхАртикулы," ");

	ЕстьПакет = Истина;	
	Для Каждого ТекАрт Из МассивАртикулов Цикл
		Если МассивСтроки.Найти(ТекАрт) = Неопределено Тогда
			ЕстьПакет =  Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьПакет;
КонецФункции

Функция УбратьИзСтрокиПакетОпций(вхАртикулы, АртикулПакета)
	МассивАртикулов = обРазложитьСтрокуВМассивПодстрок(АртикулПакета," ");
	МассивСтроки = обРазложитьСтрокуВМассивПодстрок(вхАртикулы," ");
	Для Каждого ТекАрт Из МассивАртикулов Цикл
		Индекс = МассивСтроки.Найти(ТекАрт);
		Если  Не (Индекс= Неопределено) Тогда
			МассивСтроки.Удалить(Индекс);
		КонецЕсли;
	КонецЦикла;
	Ответ ="";
	этоПерв = Истина;
	Для Каждого ТекАрт  из МассивСтроки Цикл
		Если этоПерв Тогда
			этоПерв = Ложь;
		Иначе
			Ответ=Ответ+" ";
		КонецЕсли;
		Ответ=Ответ+ТекАрт;
	КонецЦикла;
	Возврат Ответ;
	
КонецФункции

Процедура Подключиться() Экспорт
	
	АдресWS	 = Константы.Renault_АдресWebСервисов.Получить();
	ЛогинWS	 = Константы.Renault_ЛогинВебСервиса.Получить();
	ПарольWS = Константы.Renault_ПарольВебСервиса.Получить();
	
	
	//удалим определение документа wsdl - его добавляем автоматически
	АдресWS = СтрЗаменить(АдресWS, "ws/storeexchange.ws?wsdl", "");
	
	ВСОпределение = Новый WSОпределения(СокрЛП(АдресWS) + "ws/storeexchange.ws?wsdl",
									СокрЛП(ЛогинWS), СокрЛП(ПарольWS));
	
	ВебСервис = Новый WSПрокси(ВСОпределение, "http://renault-nissan.com/schema/storeeschange", 
							   "ОбменСклад", "ОбменСкладSoap12", 6000);
	
	ВебСервис.Пользователь	 = СокрЛП(ЛогинWS);
	ВебСервис.Пароль		 = СокрЛП(ПарольWS);	
	
КонецПроцедуры

СтоимостьДоставкиПоУмолчанию = 0;
